
# Тут хранится небольшая таблица значений функции Лапласа, которую используют при расчетах доверительных интервалов.

module Laplas
  module_function

  DATA = {
    0.0 => 0.0000, 0.45 => 0.1736, 0.48 => 0.1844, 0.5 => 0.1915,
    0.95 => 0.3289, 1.44 => 0.4251, 1.65 => 0.4505, 1.96 => 0.4750,
    2.58 => 0.4951, 2.8 => 0.4974, 3.0 => 0.49865, 5.0 => 0.499997
  }.freeze

  def get_parm(y)
    # Ищем табличное значение 
    DATA.each { |key, value| return key if value == y }
    return 1.96 if (y - 0.475).abs < 0.001
    return 2.58 if (y - 0.495).abs < 0.002

    5
  end
end
